In [4]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting to 'postgresql://admin:***@db:5432/company'

In [5]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

+----+------+----------+------------+-----------+--------+
| id | name | postiion | department | hire_date | salary |
+----+------+----------+------------+-----------+--------+
+----+------+----------+------------+-----------+--------+

In [6]:
%%sql
INSERT INTO employee (name, postiion, department, hire_date, salary)
VALUES ('Gaurav', 'Tech Lead', 'Software developer', '2025-11-11', 135000.00);

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [7]:
%%sql
SELECT * FROM employee

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

+----+--------+-----------+--------------------+------------+-----------+
| id |  name  |  postiion |     department     | hire_date  |   salary  |
+----+--------+-----------+--------------------+------------+-----------+
| 1  | Gaurav | Tech Lead | Software developer | 2025-11-11 | 135000.00 |
+----+--------+-----------+--------------------+------------+-----------+

In [8]:
%%sql
INSERT INTO employee (name, postiion, department, hire_date, salary)
VALUES 
    ('Sidhart', 'Database Enginer', 'Software developer', '2025-11-11', 60000.00),
    ('Ankit', 'Backend Enginer', 'Software developer', '2025-11-11', 120000.00);

Running query in 'postgresql://admin:***@db:5432/company'

2 rows affected.

++
||
++
++

In [9]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

3 rows affected.

+----+---------+------------------+--------------------+------------+-----------+
| id |   name  |     postiion     |     department     | hire_date  |   salary  |
+----+---------+------------------+--------------------+------------+-----------+
| 1  |  Gaurav |    Tech Lead     | Software developer | 2025-11-11 | 135000.00 |
| 2  | Sidhart | Database Enginer | Software developer | 2025-11-11 |  60000.00 |
| 3  |  Ankit  | Backend Enginer  | Software developer | 2025-11-11 | 120000.00 |
+----+---------+------------------+--------------------+------------+-----------+

In [10]:
%%sql
ALTER TABLE employee
RENAME COLUMN postiion TO position;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [11]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

3 rows affected.

+----+---------+------------------+--------------------+------------+-----------+
| id |   name  |     position     |     department     | hire_date  |   salary  |
+----+---------+------------------+--------------------+------------+-----------+
| 1  |  Gaurav |    Tech Lead     | Software developer | 2025-11-11 | 135000.00 |
| 2  | Sidhart | Database Enginer | Software developer | 2025-11-11 |  60000.00 |
| 3  |  Ankit  | Backend Enginer  | Software developer | 2025-11-11 | 120000.00 |
+----+---------+------------------+--------------------+------------+-----------+

In [12]:
%%sql
INSERT INTO employee (name, position, department, hire_date, salary)
VALUES ('Himani Gautam', 'Senior HR', 'Human Resources', '2025-11-11', 200000.00);

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [13]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+----+---------------+------------------+--------------------+------------+-----------+
| id |      name     |     position     |     department     | hire_date  |   salary  |
+----+---------------+------------------+--------------------+------------+-----------+
| 1  |     Gaurav    |    Tech Lead     | Software developer | 2025-11-11 | 135000.00 |
| 2  |    Sidhart    | Database Enginer | Software developer | 2025-11-11 |  60000.00 |
| 3  |     Ankit     | Backend Enginer  | Software developer | 2025-11-11 | 120000.00 |
| 4  | Himani Gautam |    Senior HR     |  Human Resources   | 2025-11-11 | 200000.00 |
+----+---------------+------------------+--------------------+------------+-----------+

In [14]:
%%sql
TRUNCATE TABLE employee;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [15]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

+----+------+----------+------------+-----------+--------+
| id | name | position | department | hire_date | salary |
+----+------+----------+------------+-----------+--------+
+----+------+----------+------------+-----------+--------+

##### If you use Truncate to remove all the data from table, and if you have used any seriel data type then that won't start from 0 again

In [16]:
%%sql
INSERT INTO employee (name, position, department, hire_date, salary)
VALUES ('Himani Gautam', 'Senior HR', 'Human Resources', '2025-11-11', 200000.00);

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [17]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

+----+---------------+-----------+-----------------+------------+-----------+
| id |      name     |  position |    department   | hire_date  |   salary  |
+----+---------------+-----------+-----------------+------------+-----------+
| 5  | Himani Gautam | Senior HR | Human Resources | 2025-11-11 | 200000.00 |
+----+---------------+-----------+-----------------+------------+-----------+

In [21]:
%%sql
TRUNCATE TABLE employee RESTART IDENTITY;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [22]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

+----+------+----------+------------+-----------+--------+
| id | name | position | department | hire_date | salary |
+----+------+----------+------------+-----------+--------+
+----+------+----------+------------+-----------+--------+

In [23]:
%%sql
INSERT INTO employee (name, position, department, hire_date, salary)
VALUES ('Himani Gautam', 'Senior HR', 'Human Resources', '2025-11-11', 200000.00);

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [24]:
%%sql
SELECT * FROM employee;

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

+----+---------------+-----------+-----------------+------------+-----------+
| id |      name     |  position |    department   | hire_date  |   salary  |
+----+---------------+-----------+-----------------+------------+-----------+
| 1  | Himani Gautam | Senior HR | Human Resources | 2025-11-11 | 200000.00 |
+----+---------------+-----------+-----------------+------------+-----------+

##### If you used RESTART IDENTITY then serial datatype will reset too.